import { FC } from 'react';

import Marble from '@assets/img/pradenW.png';
import Eblan from '@assets/img/eblan.png';
import './Documentation.scss';

const Documentation: FC = () => {
  return (
    <div className='documentation'>
      <h2 id='motivation'>Мотивація створення аукціону</h2>
      <div>
        Велика проблема звичайних аукціонів полягає в тому, що стрімеру доводиться витрачати багато часу на ручне
        введення ставок та постійне звірення з donation alerts. Крім того, стрімер може щось пропустити, і потім
        доводиться згадувати, що він вводив, або шукати кліпи.
      </div>
      <div>
        Більшість таких проблем вирішує цей аукціон. Таким чином, стрімер може витрачати менше часу на технічні моменти,
        менше напружуватись і більше взаємодіяти з аудиторією.
      </div>
      <div>Також я намагаюся додавати технічні нововведення, які можуть зробити проведення аукціону цікавішим.</div>

      <h2 id='main-feature'>Основна функція аукціону</h2>
      <div>Активування інтеграції додає безліч нових функцій:</div>
      <ol>
        <li>
          Усі нові ставки відображаються у вигляді карток під таймером.
          <ul>
            <li>Картки можна перетягувати прямо на елемент, щоб додати суму до його вартості.</li>
            <li>На картці є кнопка "новий", щоб швидко створити новий елемент.</li>
            <li>Здійснюється частковий пошук за назвою для автоматичного додавання ставки до елемента.</li>
          </ul>
        </li>
        <li>При повному співпадінні назв ставка додається автоматично.</li>
        <li>Доступне швидке додавання через введення короткого номеру елемента.</li>
      </ol>

      <h2 id='point-auc'>Поінтовий аукціон</h2>
      <div>
        Інтеграція з Twitch дозволяє автоматично створювати, приховувати та видаляти винагороди для глядачів, які хочуть
        підтримати стрімера за поінти каналу.
      </div>

      <h2 id='donate-auc'>Донатний аукціон</h2>
      <div>
        Дозволяє інтегрувати зовнішні платформи донатів. Система автоматично обробляє всі нові надходження і додає їх до
        відповідних елементів аукціону.
      </div>

      <h2 id='marbles-auc'>Аукціон кульок</h2>
      <div>
        Розважальний режим із забігом кульок, де кожен глядач отримує свою кульку і бере участь у випадковому змаганні
        за приз.
      </div>

      <h2 id='wheel'>Колесо</h2>
      <div>
        Випадковий вибір переможця серед учасників за допомогою обертання колеса. Ймовірність залежить від суми внесків
        кожного учасника.
      </div>

      <h2 id='statistic'>Статистика</h2>
      <div>
        Формується аналітика за результатами аукціонів: активність глядачів, популярність слотів, загальні суми ставок,
        графіки динаміки ставок.
      </div>

      <h2 id='history'>Історія</h2>
      <div>
        Повний журнал усіх проведених ставок із можливістю перегляду деталей, аналізу історії та обробки скасувань
        ставок.
      </div>
    </div>
  );
};

export default Documentation;
