import { FC } from 'react';

import Marble from '@assets/img/pradenW.png';
import Eblan from '@assets/img/eblan.png';
import './Documentation.scss';

const Documentation: FC = () => {
  return (
    <div className='documentation'>
      <h2 id='motivation'>Мотивація створення аукціону</h2>
      <div>
        Велика проблема звичайних аукціонів полягає в тому, що стрімеру доводиться витрачати багато часу на ручне
        введення ставок та постійне звірення з donation alerts. Крім того, стрімер може щось пропустити, і потім
        доводиться згадувати, що він вводив, або шукати кліпи.
      </div>
      <div>
        Більшість таких проблем вирішує цей аукціон. Таким чином, стрімер може витрачати менше часу на технічні моменти,
        менше напружуватись і більше взаємодіяти з аудиторією.
      </div>
      <div>Також я намагаюся додавати технічні нововведення, які можуть зробити проведення аукціону цікавішим.</div>
      <h2 id='main-feature'>Основна функція аукціону</h2>
      <div>Активування інтеграції додає безліч нових функцій:</div>
      <ol>
        <li>
          Усі нові ставки відображаються у вигляді карток під таймером.
          <ul>
            <li>Картки можна перетягувати прямо на елемент, щоб додати суму до його вартості.</li>
            <li>На картці є кнопка &quot;новий&quot;, щоб швидко створити новий елемент.</li>
            <li>
              <div>
                {
                  'На картці може з’явитися кнопка "до <назва елемента>", якщо є елемент, назва якого співпадає з назвою ставки >60%. Натиснувши кнопку, ставка автоматично додасться до цього елемента.'
                }
              </div>
              <div>Пошук за частковим співпадінням здійснюється лише в момент появи картки для оптимізації.</div>
            </li>
          </ul>
        </li>
        <li>
          Якщо назва ставки повністю співпадає з назвою елемента, то ставка додається автоматично. (також
          запам’ятовуються назви всіх ставок, які були додані до одного елемента).
        </li>
        <li>
          {
            'Ставки можна робити, вказавши лише короткий номер елемента "#<ключ>", який вказаний поруч із позицією елемента. Це значно швидше та автоматично додає ставку до елемента.'
          }
        </li>
      </ol>
      <h2 id='point-auc'>Поінтовий аукціон</h2>
      <div>На сторінці інтеграції можна налаштувати список винагород.</div>
      <div>
        При натисканні кнопки &quot;Активувати винагороди&quot; на каналі АВТОМАТИЧНО створюються винагороди зі списку.
        Після цього кнопка змінюється на &quot;Сховати винагороди&quot;, яка приховує винагороди для глядача, але вони
        залишаються на каналі й їх можна повернути.
      </div>
      <div>При натисканні &quot;Видалити винагороди&quot; винагороди повністю видаляються з каналу.</div>
      <div style={{ color: '#ff6868' }}>
        Винагороди можна буде повернути на вкладці Історія або в дашборді Twitch, АЛЕ ТІЛЬКИ ДО ЇХ ВИДАЛЕННЯ.
        <br />
        ПОПЕРЕДНІ ВИНАГОРОДИ ВИДАЛЯЮТЬСЯ ПРИ ЇХ ЗМІНІ.
      </div>
      <h2 id='donate-auc'>Донатний аукціон</h2>
      <h2 id='marbles-auc'>Аукціон кульок</h2>
      <h2 id='wheel'>Колесо</h2>
      <h2 id='statistic'>Статистика</h2>
      <h2 id='history'>Історія</h2>
    </div>
  );
};

export default Documentation;
