import { FC } from 'react';

const DuelWheelProof: FC = () => {
  return (
    <>
      <div style={{ color: '#e5c938' }}>Як працює цей режим?</div>
      <div>
        Варіанти аукціону борються один з одним, що переміг варіант
        <span style={{ color: '#ff5c36' }}> забирає собі вартість </span>
        програв і просувається далі у турнірній сітці.
        <br />
        (Порядок ходів збудований так, що спочатку грається нижня сітка, потім верхня)
      </div>
      <div>
        Просто тисніть крутити, а далі розберетеся. Також ви можете вивчати турнірну сітку, натисніть на позицію, щоб
        простежити весь шлях елемента.
      </div>
      <div style={{ color: '#e5c938' }}>Чи зберігаються шанси при такому форматі?</div>
      <div>
        <span style={{ color: '#59ce4b' }}> Абсолютно точно ТАК! </span>
        Шанс елемента виграти в цьому форматі такий самий, як і у звичайному колесі, а що найцікавіше, немає ніякого.
        різниці в якому порядку проводяться дуелі, шанси залишаються тими самими.
      </div>
      <div>У мене поки не було часу оформити пруфи, але скоро я їх додам.</div>
      <div style={{ color: '#e5c938' }}>Чи зберігаються шанси при групуванні елементів?</div>
      <div style={{ color: '#59ce4b' }}> ТАК! </div>
      <div>
        Я все це математично прораховував і симулював, весь функціонал, який є на сайті, повністю відповідає звичайному
        коліс за шансами і буквально кожен рубль враховується у шансах на перемогу.
      </div>
      <div>Для детального роз'яснення можете написати мені дис (контакти на сторінці гайду)</div>
    </>
  );
};

export default DuelWheelProof;
