import dayjs from 'dayjs';
import { ReactNode } from 'react';
import VerticalSplitIcon from '@mui/icons-material/VerticalSplit';
import { Link as RouterLink } from 'react-router-dom';
import { Link } from '@mui/material';

export interface UpdateData {
  date: string;
  newFeatures?: ReactNode[];
  improvements?: ReactNode[];
  fixes?: ReactNode[];
}

const updates: UpdateData[] = [
  {
    date: '2024-08-12T06:10:00.744Z',
    newFeatures: [
      <div>
        <p>
          Додана опція зручного повернення балів, ви можете скористатися нею на сторінці{' '}
          <RouterLink to='/history'>Історія</RouterLink> або після обертання колеса. Доступні наступні опції:
        </p>
        <ul>
          <li>Повернути бали всім, окрім переможця колеса</li>
          <li>Повернути всім, окрім першого місця</li>
          <li>Повернути всім</li>
          <li>Забрати у всіх</li>
        </ul>
      </div>,
    ],
  },
  {
    date: '2024-08-09T10:00:00.822Z',
    newFeatures: [
      'На сторінці колеса додано список поточних елементів. У ньому можна виділити вибраний елемент та приховати вибулі елементи у колесі на вибування.',
      'Анімація "з’їдання" елемента в колесі на вибування :)',
    ],
    improvements: [
      'Налаштування "Розділення" в колесі тепер розподіляє однакові елементи на однаковій відстані один від одного. Працює дуже круто, рекомендую спробувати.',
      '"Розділення" можна використовувати в колесі на вибування, і це не вплине на шанси елементів.',
      'Ви можете вільно перемикатися між режимами колеса, і це не скине стан колеса (наприклад, вибулі елементи будуть збережені). Колесо все ще обнуляється, якщо повністю вийти зі сторінки колеса.',
    ],
  },
  {
    date: '2024-04-29T04:15:00.882Z',
    fixes: [
      <div>
        <p>Виправлено інтеграцію з DONATE PAY, тепер вона повинна працювати у всіх.</p>
        <p>Якщо щось не працює, відправляйте баг-репорт за допомогою кнопки в нижній частині екрана.</p>
      </div>,
      'На таймері тепер відображаються години, хвилини та секунди, якщо час перевищує 1 годину.',
    ],
  },
  {
    date: '2024-04-26T14:30:00.092Z',
    improvements: [
      <div>
        <p>
          Оновлено колесо на ВИБУВАННЯ. Тепер у ньому значно більше інтриги, а розміри секторів мають викликати менше
          питань.
        </p>
        <p>("класичне" колесо на вибування працює правильно і все ще доступне на сайті)</p>
      </div>,
    ],
  },
  {
    date: '2024-04-23T14:05:00.834Z',
    improvements: ['Правила більше НЕ ПЕРЕСКАКУЮТЬ при наведенні курсора. Тепер потрібно натиснути для редагування.'],
  },
  {
    date: '2024-04-23T09:30:34.826Z',
    improvements: ['Додана можливість змінювати фон та розмір правил.'],
  },
  {
    date: '2024-04-22T12:45:21.046Z',
    newFeatures: [
      <>
        <div>
          <span>Додано редактор правил аукціону. Ви можете відкрити його, натиснувши кнопку </span>
          <VerticalSplitIcon style={{ position: 'relative', top: 6 }} />
          <span> у нижній панелі.</span>
        </div>
        <p style={{ lineHeight: 1.5 }}>
          У вас може бути кілька правил, між якими можна перемикатися. Правила зберігаються в браузері під час
          редагування.
        </p>
      </>,
    ],
  },
  {
    date: '2024-04-21T05:10:00.098Z',
    fixes: [
      'Виправлено помилку, коли в аукціон потрапляли зайві нагороди за бали каналу, які впливали на роботу сайту.',
    ],
  },
  {
    date: '2024-01-14T12:21:05.669Z',
    newFeatures: ['Завантаження списку елементів з файлу XSLX.'],
  },
  {
    date: '2023-12-22T09:24:10.217Z',
    newFeatures: ['Додано налаштування для приховування вартості елементів та ставок.'],
  },
  {
    date: '2023-12-03T09:34:21.786Z',
    newFeatures: ['На сторінці інтеграцій можна відключити автоматичне додавання ставок.'],
    improvements: [
      <>
        <span>API: </span>
        <span className='spoiler'>/lot/getAll змінено на /lots</span>
      </>,
      <>
        <span>API: </span>
        <span className='spoiler'>додано новий ендпоінт /bid/status</span>
      </>,
      <>
        <span>API: </span>
        <span className='spoiler'>нові параметри: POST /bid - insertStrategy, PUT /lot - amountChange</span>
      </>,
    ],
  },
  {
    date: '2023-12-01T09:42:45.373Z',
    newFeatures: [
      'Нове налаштування таймера. Тепер можна автоматично додавати час, якщо на таймері менше певної кількості хвилин.',
    ],
    improvements: [
      'Покращена оптимізація сайту. Головна сторінка працює без затримок за будь-якої кількості елементів (тестувалось на 10,000).',
    ],
    fixes: ['Виправлено неправильний підрахунок вартості кульки в аукціонах з кульками.'],
  },
  {
    date: '2023-11-26T06:31:49.508Z',
    fixes: ['Виправлено помилку, через яку деякі елементи, які повинні додаватися автоматично, просто зникали.'],
  },
  {
    date: '2023-11-24',
    newFeatures: [
      'Додана форма для відправки помилок у нижній панелі головної сторінки.',
      <div>
        <b>API: </b>
        <Link href='https://github.com/Pointauc/Pointauc.Api' target='_blank'>
          бібліотека для c#
        </Link>{' '}
        by NowaruAlone
      </div>,
      <div>
        <b>API: </b>
        <Link href='https://github.com/sofrin/auc-discordbot' target='_blank'>
          discord-бот для замовлень сабів
        </Link>{' '}
        by Sofrin
      </div>,
    ],
    improvements: ['Покращено переклад українською та англійською мовами.'],
    fixes: [
      'При завантаженні минулих елементів могли дублюватися їх id, через що не можна було вказати короткий номер елемента.',
    ],
  },
  {
    date: '2023-11-18',
    newFeatures: [
      <div>
        Додано публічне API аукціону, за допомогою якого ви можете програмно надсилати ставки на сайт через сторонніх
        ботів. Документацію можна знайти за цим{' '}
        <Link href='https://app.theneo.io/bf08f5b1-1025-4a83-8518-14458df03592/pointauc/api-reference' target='_blank'>
          посиланням
        </Link>
      </div>,
    ],
  },
  {
    date: '2023-11-12',
    newFeatures: ['Додані налаштування зовнішнього вигляду, які дозволяють змінити кольорову палітру сайту.'],
    improvements: [
      'Під час відкриття сайту автоматично завантажуються елементи з вашої останньої сесії.',
      'Сайт періодично зазнає DDOS атак. Захист поступово покращується, але для повного усунення їх впливу потрібен час.',
      'Оновлені майже всі сторонні бібліотеки.',
      'Покращено деякі елементи інтерфейсу.',
    ],
  },
  {
    date: '2023-10-15',
    newFeatures: [
      'Додана підтримка сервісу DonatePay.',
      'Картку зі ставкою тепер можна додати до випадкового елемента.',
    ],
    improvements: [
      'Зміни у налаштуваннях зберігаються відразу після редагування без необхідності натискання кнопки "зберегти".',
      'Значно пришвидшено завантаження профілю.',
    ],
    fixes: [
      'Додавання часу під час донату не працювало коректно.',
      'У колесі не відображалися стандартні смайли.',
      'Розділення елементів не працювало з колесом на вибування. Тепер цю опцію неможливо випадково вибрати.',
    ],
  },
];

const getUpdatesFromDate = (from: string): UpdateData[] => {
  if (/\d\d\.\d\d\.\d\d\d\d/.test(from)) {
    const normalizedDate = dayjs(from, 'DD.MM.YYYY').format('YYYY-MM-DD');

    return getUpdatesFromDate(normalizedDate);
  }

  const unseenChangelogEnd = updates.findIndex(({ date }) => {
    const dateInstance = dayjs(date);

    return dateInstance.isSame(from) || dateInstance.isBefore(from);
  });

  return unseenChangelogEnd > -1 ? updates.slice(0, unseenChangelogEnd) : updates;
};

export const getUpdates = (date: string): UpdateData[] => {
  return date === '' ? [] : getUpdatesFromDate(date);
};
